# Початкова сума
p = 1000

# Річний прибуток
r = 0.1

# Кількість років
n1 = 10
n2 = 20
n3 = 30

# Розраховуємо суму,  р - початковий баланс, помноживши його  на суму (1 + r) де 'r' це відсоток за  рік ми отримаємо суму
# яка буде на балансі через 1 рік далі ми підносимо цю суму до степеня 10, де 10 це кількість років і повторюємо так
# з іншими роками
a1 = p * (1 + r) ** n1
a2 = p * (1 + r) ** n2
a3 = p * (1 + r) ** n3

# Виведення результатів
print("Сума через 10 років:", round(a1, 2))
print("Сума через 20 років:", round(a2, 2))
print("Сума через 30 років:", round(a3, 2))