print('Привіт! Напиши 5 цілих чисел та ми визначемо яке з них має найбільше, найменше та середє значення')

num1 = int(input('Введи перше число  ' ))
num2 = int(input('Введи друге число  ' ))
num3 = int(input('Введи третє число  ' ))
num4 = int(input('Введи четверте число  ' ))
num5 = int(input('Введи пяте число  ' ))

#створюємо кортеж зі всіма введеними значеннями для визначення найбільшого та найменшого
othet_num = (num1, num2, num3, num4, num5)

print('Найбільше число:', max(othet_num))
print('Найменше число:', min(othet_num))

# перетворюємо кортеж в список для того щоб в подальшому відсортувати в порядку зростання
othet_num = list(othet_num)
othet_num.sort()

# так як нам відомо що значень всього 5 тому після сортування середнє значення буде під індексом 2
print('Середнє число:', othet_num[2] )
